import React, { useState } from 'react';
import { Document, Page, Text, View, StyleSheet, PDFViewer, Font } from '@react-pdf/renderer';
import SignaturePad from './SignaturePad.jsx';
Font.register({ family: 'Rubik', src: "http://fonts.gstatic.com/s/rubik/v3/4sMyW_teKWHB3K8Hm-Il6A.ttf" });

const styles = StyleSheet.create({
    page: {
        flexDirection: 'row',
        backgroundColor: '#E4E4E4',
    },
    section: {
        margin: 10,
        padding: 10,
        flexGrow: 1,
        fontFamily: 'Rubik',
    },
});

function StringToPdfConverter() {
    const [name, setName] = useState('');
    const [id, setId] = useState('');
    const [signature, setSignature] = useState('');

    const handleNameChange = (e) => {
        setName(e.target.value || '');
    };

    const handleIdChange = (e) => {
        setId(e.target.value || '');
    };

    const handleSignatureChange = (e) => {
        setSignature(e.target.value || '');
    };

    const renderPdfContent = () => {
        const pdfText = `             
        כתב שחרור מאחריות  (ויתור על תביעות)
        על ידי חתימתך על מסמך זה הנך מוותר/ת בזאת על כל זכות, מכל מן וסוג שהיא, לרבות על הזכות לתבוע ו/או על הזכות לשיפוי אשר עשויה להיווצר בגין השכרת כלי הנהיגה כאמור להלן, הכרוכה בסיכונים ובחוסר נוחות. ובידוע שכל העושה בהם שימוש עלול להיפצע ו/או להיפגע פיזית ו/או להינזק כלכלית ו/או נפשית ו/או פיזית וכו'. מסמך זה מהווה "הסכמה לנטילת סיכון" ו/או "כתב ויתור ושחרור", תוקפו משפטי ומחייב ויש לקראו בעיון רב. 
        נטילת כל אחד מהדו גלגליים שלהלן: קורקינט חשמלי ,אופניים חשמליים (להלן: "הדו גלגלי" ו/או "המושכר"), מידי ישי מיר ת.ז 209215409 ו/או מי מטעמו )להלן: "המשכיר"(, לצורך עשיית שימוש בו, בין הייתר על ידי הפעלתו ו/או רכיבה עליו, כרוכה בסיכון. מסמך זה מתייחס ויכלול את כל הפעילויות, האירועים או השירותים הניתנים, מוסדרים , מאורגנים, מאושרים על ידי המשכיר הכוללים שימוש במושכר בין אם במהלך הרכיבה עצמה על הכלי ובין אם במהלך נטילתו והחזרתו. 
        לכן אני הח"מ _________________________ ת.ז ________________________ (להלן: "השוכר/ת"), מצהיר בזאת ומאשר כדלקמן: 
        א.	אני שוכר את המושכר לשימושי האישי בלבד והנני מצהיר כי לי הידע ו/או היכולת ו/או המיומנות וכו 'להפעיל את המושכר בצורה הטובה ביותר תוך שמירה על כללי הנהיגה ו/או על בריאותי. 
        ב.	כל שימוש שיעשה במושכר, שלא על ידי יהא באחריותי בלבד, על כל המשתמע מכך, בין אם שימוש כאמור יעשה על ידי קטין ו/או בוגר וכו 'מטעמי ו/או שלא מטעמי. 
        ג.	כל זמן שהמושכר נמצא בחזקתי ו/או בחזקת מי מטעמי, הנני אחראי לשמירת תקינותו ו/או תפעולו הראוי של המושכר ו/או לשלומי הבריאותי ו/או לשלום הבריאות של המשתמש מטעמי. 
        ד.	הנני מודע/ת כי השימוש בכלים מסוג המושכר טרם הוסדר רגולטורית בענף הביטוח ,וכי קיימים סיכונים לעושים בו שימוש וכי קיימת רמת חוסר נוחות הכרוכה בשימוש ו/או הפעלת המושכר, על כל המשתמע מכך.  
        ה.	הנני מצהיר/ה כי אני בריא/ה פיזית ונפשית והנני יודע/ת ומבין/נה כי שימוש במושכר, כרוכה בין היתר במאמץ גופני ואשר כשל במצבי זה עלול לגרום או להחמיר פציעות ו/או להחמיר את מצבי הבריאותי.  
        ו.	אני גם מבין/נה ומסכים/מה כי תנאי מזג האוויר ו/או גורמים בלתי צפויים אחרים עלולים להשפיע על רמת הבטיחות של השימוש במושכר ואני מקבל על עצמי את האחריות במצבים כאלה ומתחייב לשאת בכל הנזקים ו/או העלויות שיגרמו על ידי שימוש ו/או הפעלת המושכר ו/או שיגרמו לכל צד ג' מטעמי שיעשה שימש במושכר. 
        ז.	הנני מבין ויודע את המשמעויות של אופי המסוכן של השימוש ו/או הפעלת המושכר והריני מצהיר כי לא קיבלתי כל הנחיה ו/או הוראה מרופא המשפחה ו/או כל רופא להימנע מפעילות גופנית הכרוכה בהפעלתו של המושכר. 
        ח.	הנני מצהיר שהתכוננתי לקראת השימוש במושכר, הן בלימוד אופיו, והן ברכישת ידע הנחוץ לקראת השימוש בו ו/או הפעלתו והן באימונים פיזיולוגיים להכשרת הגוף לקראת השימוש ו/או הפעלת הדו גלגלי. 
        ט.	הנני מאשר ומבין שיש סיכונים אינהרנטיים וסיכונים אחרים המעורבים בסוג כזה של פעילות ואני באופן חופשי ומרצוני האישי בוחר לקחת סיכונים אלו וחוסר נוחות הכרוך לשימוש ו/או הפעלת הדו גלגלי. 
        י.	הנני משחרר/ת בזה ו/או פוטר/ת מכל אחריות את המשכיר ו/או את עובדיו ו/או כל מי שמטעמו (להלן: "הצדדים המשוחררים") מכל אחריות ו/או תביעה ו/או דרישה ו/או עילה משפטית העשויים להיות לי בגין מוות, פציעות, כול נזק או אובדן כלשהו, באם יקרו לי כתוצאה מהשימוש במושכר , בין אם נגרם בהתאם להוראות שקיבלתי ובין אם לאו, וכן נזקים כאמור שספגתי כתוצאה ממעשה או מחדל של הצדדים המשוחררים ולרבות רשלנותם. 
        יא.	הנני מסכים/מה ומתחייב/ת שלא אדרוש ולא אגיש תביעה כנגד הצדדים המשוחררים בגין נזק או אובדן ו/או כל נזק אחר שנגרם לי ואני מסכים/מה לפצות ולשפות את הצדדים המשוחררים בגין כל חיוב שיושת עליהם, לרבות הוצאות ושכר טרחת עורכי דין, הנובע במישרין או בעקיפין ולרבות בגין רשלנותם של הצדדים המשוחררים. 
        יב.	אני לבדי אהיה אחראי/ת לכל נזק ו/או אובדן ו/או תאונה ו/או פציעה מכל מין וסוג ישירים ו/או עקיפים ו/או תוצאתיים, שיגרמו לגוף ו/או לרכוש, לרבות לי ו/או לכל דבר ו/או גורם ו/או צד שלישי אחרים מטעמי. 
        יג.	מבלי לגרוע מכלליות האמור אין ולא תהיה לי כל טענה ו/או תביעה ו/או דרישה, מכל מין וסוג, כלפי המארגן ו/או מקדמיו ו/או מממניו לרבות מי מפקידיהם ו/או סוכניהם ו/או נציגיהם, זאת אף אם ניתן לייחס למי מהם ו/או לכל גורם אחר רשלנות ו/או מחדל. 
        יד.	הריני מתחייב/ת כי במקרה ובהליך משפטי כלשהו בו יקבע כי רשלנותם של הצדדים המשוחררים גרמה למותי, פציעתי או נזקיי האחרים, אזי אהיה אחראי/ת לפצות ולשפות את הצדדים המשוחררים בגין כל סכום שיפסק כנגדם במסגרת הליך כאמור. 
        טו.	הנני לאשר כי הובהר לי והבנתי היטב שהשימוש במושכר כרוך בסיכונים ובסכנות שגם זהירות ו/או השגחה ו/או הכשרה ו/או הדרכה ו/או מומחיות, אינם יכולים למנוע ועל כן הנני נוטל/ת על עצמי באופן מפורש ומרצון את כל הסיכונים שיגרמו לי ו/או למשתמשים  מטעמי לפגיעה ו/או לפציעה ו/או מוות, נזק גופני ואבדן כלכלי שעלולים להיגרם לי, בין אם נגרמו ברשלנותם של הצדדים המשוחררים ובין אם לא. 
        טז.	הנני מצהיר/ה כי אני בריא/ה וכשיר/ה לחתום על הסכם זה וכי כתב התחייבותי זה תופס לשלושה חודשים ממועד חתמתי ויהא תקף אף להשכרת המושכר לשימושים חוזרים במהלך תקופה זו בין אם על ידי ובין אם לכל המורשה מטעמי. 
        יז.	קראתי את כל האמור בהסכם זה, הנני מבין/נה את תכנו הבנה מלאה והנני מסכים/מה באישור התשלום להיות מחויב/ת על ידו. 
        
        
        תאריך:  	 	 	 	 	 	 	    חתימה: 	_______________________________ 	 	
        במקרה של קטין מתחת לגיל 18
        אני______ ____________ ת.ז_________________ אפוטרופסו החוקי של הקטין____________ _______ת.ז__________ ___ מצהיר בזה כי קראת בעיון רב את כל האמור במסמך זהו לאחר שהבנתי והפנמתי את תוכנו, אני מקבלו ומאשרו וחותם עליו מרצוני הטוב והחופשי. תוקף אישור זה הינו ממועד חתימתו ועד לתאריך._____________ 
        תאריך:  ______________________________.                 	 	         חתימה: __________________________________ 
        `

        return (
            <Document>
                <Page size="A4" style={styles.page}>
                    <View style={styles.section}>
                        <Text>{pdfText}</Text>
                    </View>
                </Page>
            </Document>
        );
    };

    return (
        <div>
            <div>
                <label htmlFor="name">שם:</label>
                <input type="text" id="name" value={name} onChange={handleNameChange} />
            </div>
            <div>
                <label htmlFor="id">ת.ז:</label>
                <input type="text" id="id" value={id} onChange={handleIdChange} />
            </div>
            <div>
                <label htmlFor="signature">חתימה:</label>
                <input type="text" id="signature" value={signature} onChange={handleSignatureChange} />
            </div>
            <br />
            <PDFViewer width="500" height="600">
                {renderPdfContent()}
            </PDFViewer>
        </div>
    );
}

export default StringToPdfConverter;
